{
    "What is the base feedstock for the chemical, material or product you are making?": {
        "ui:widget": "textarea"
    },
    "Select the following attributes that describe the base feedstock:": {
        "ui:widget": "checkboxes"
    },
    "Is the biobased feedstock rapidly renewable?": {
        "ui:widget": "radio"
    },
    "Is the biobased feedstock sustainably harvested, such as wood certified by the Forest Stewardship Council (FSC)?": {
        "ui:widget": "radio"
    },
    "Is it certified sustainably harvested?": {
        "ui:widget": "radio"
    },
    "Is the biobased feedstock waste-based (exempli gratia, agricultural waste)?": {
        "ui:widget": "radio"
    },
    "Does the biobased feedstock compete for land use with social, ecological, or food production value?": {
        "ui:widget": "radio"
    },
    "Is the recycled material post consumer?": {
        "ui:widget": "radio"
    },
    "Is the recycled material post industrial?": {
        "ui:widget": "radio"
    },
    "Does generation of your product from this feedstock result in downcycling, or does it maintain the value level, or increase the value level?": {
        "ui:widget": "radio"
    },
    "Have you requested information about the purity of the material? Some materials, such as those derived from mixed plastics may contain residual toxic chemicals that were added as flame retardants or plasticizers in the previous products": {
        "ui:widget": "radio"
    },
    "Can the feedstock be depleted (id est, it is not renewable)?": {
        "ui:widget": "radio"
    },
    "Is that feedstock currently considered abundant or rare?": {
        "ui:widget": "radio"
    },
    "Are there any known social and environmental issues associated with the raw material feedstock you are using?": {
        "ui:widget": "checkboxes"
    },
    "Do you use catalysts?": {
        "ui:widget": "radio"
    },
    "Despite the relatively small quantity used, catalysts can have an outsized environmental footprint! Are the catalysts made from:": {
        "ui:widget": "radio"
    }
}
