{
    "chemicalInventory": {
        "What chemicals and materials are used during production and manufacturing?  Consider reagents, catalysts, auxiliaries, and ingredients intentionally added to provide performance properties.": {
            "ui:widget": "textarea"
        },
        "Are the chemicals used during production and manufacturing hazardous?": {
            "ui:widget": "radio"
        },
        "What chemicals and materials are produced during production and manufacturing?": {
            "ui:widget": "textarea"
        },
        "Are the chemicals produced during production and manufacturing hazardous?": {
            "ui:widget": "radio"
        },
        "Are the chemicals in a form that can be inhaled, ingested or absorbed through the skin?": {
            "ui:widget": "radio"
        },
        "Are the chemicals used or produced in a form that is hazardous to workers?": {
            "ui:widget": "radio"
        },
        "What is the hazard?": {
            "ui:widget": "textarea"
        }
    },
    "exposureAssessment": {
        "Who is likely to be exposed to production chemicals during production and manufacturing? Workers? Nearby communities?": {
            "ui:widget": "checkboxes"
        },
        "For chemicals used and produced during production and manufacturing, what are the likely routes of exposure?": {
            "ui:widget": "checkboxes"
        },
        "What are the relative volumes? And how long and how frequent are the exposures likely to be?": {
            "ui:widget": "textarea"
        }
    },
    "hazardAssessment": {
        "Have you conducted a screening chemical hazard assessment on the chemicals used and produced?": {
            "ui:widget": "radio"
        },
        "Have you conducted a comprehensive chemical hazard assessment, particularly on chemicals for which there is worker and/or community exposure?": {
            "ui:widget": "radio"
        },
        "Have you mapped chemical exposure to chemical hazards using a method such as control banding?": {
            "ui:widget": "radio"
        }
    },
    "stakeholder": {
        "Are there potential impacts be to workers and those who live around the production or manufacturing facility who may be exposed to chemicals used in production and manufacturing?": {
            "ui:widget": "radio"
        },
        "Impacts:": {
            "ui:widget": "textarea"
        },
        "Quantity, frequency and level of annoyance:": {
            "ui:widget": "textarea"
        },
        "Will the materials and manufacturing related to your product create equal opportunities and fair labor conditions? Describe how.": {
            "ui:widget": "textarea"
        },
        "How will your product contribute to or hinder local economic development in the area where it is produced?": {
            "ui:widget": "textarea"
        }
    },
    "lifecycle": {
        "What wastes are created during production and manufacturing?": {
            "ui:widget": "textarea"
        },
        "Are these wastes hazardous?": {
            "ui:widget": "radio"
        },
        "How are these wastes disposed of?": {
            "ui:widget": "checkboxes"
        },
        "Are the wastes removed by the wastewater treatment plant?": {
            "ui:widget": "radio"
        },
        "Are hazardous components removed prior to discharge?": {
            "ui:widget": "radio"
        },
        "Do you measure the use of energy, water and materials and the generation of waste in order to benchmark a product against other products to maximize resource efficiency?": {
            "ui:widget": "radio"
        }
    }
}
