{
    "How would you describe the type of product are you planning to make? For example, is the product a substance, a formulated chemical product, a material, or an article? Is it a homogenous or heterogenous material? What is the product?": {
        "ui:widget": "textarea"
    },
    "Who are the intended users?": {
        "ui:widget": "textarea"
    },
    "What is the service provided by the product?": {
        "ui:widget": "textarea"
    },
    "What other products are used to provide this service?": {
        "ui:widget": "textarea"
    },
    "What sustainability attributes are you prioritizing to include in the design? Consider the product overall and at each life cycle stage.": {
        "ui:widget": "textarea"
    },
    "feedstock": {
        "What is the preferred feedstock goal or goals? Please select all that apply": {
            "ui:widget": "checkboxes"
        },
        "If you've selected 'Bio-based' for the previous question:": {
            "ui:widget": "radio"
        }
    },
    "production": {
        "Do you have goals to reduce life cycle impacts such as water consumption, waste generation or energy usage in production or manufacturing?": {
            "ui:widget": "checkboxes"
        },
        " ": {
            "ui:widget": "textarea"
        }
    },
    "priorities": {
        "Are you designing the product to contain only ingredients that are recognized as inherently safer such as those on the EPA Safer Chemical Ingredient List (SCIL)? Or are you avoiding chemicals of concern such as those identified on sector-based Restricted Substances Lists (RSLs). ": {
            "ui:widget": "checkboxes"
        },
        " ": {
            "ui:widget": "textarea"
        }
    },
    "waste": {
        "How long is this product designed to be used for? For example, LEGO blocks are designed for a long use phase, even multi-generational: Blocks made today fit those made more than 50 years ago.": {
            "ui:widget": "radio"
        }
    },
    "waste2": {
        "ui:title": " ",
        "What attributes are you seeking to meet your longevity goal?": {
            "ui:widget": "checkboxes"
        },
        " ": {
            "ui:widget": "textarea"
        }
    },
    "waste3": {
        "ui:title": " ",
        "Are you designing the product for recycling or for biodegradation in wastewater treatment plants or in commercial composting operations?": {
            "ui:widget": "checkboxes"
        },
        " ": {
            "ui:widget": "textarea"
        },
        "What test(s) will you perform to ensure your product is biodegradable or compostable in these conditions?": {
            "ui:widget": "textarea"
        },
        "What certification(s) will you pursue to guarantee your product is biodegradable or compostable in these conditions?": {
            "ui:widget": "textarea"
        }
    },
    "overall": {
        "Are you planning to meet requirements for an eco-label, standard or environmentally preferable product purchasing specifications?": {
            "ui:widget": "radio"
        },
        "Which label?" : {
            "ui:widget": "checkboxes"
        }
    },
    "overall2": {
        "ui:title": " ",
        "Are you striving for specific life cycle improvements compared to other products that provide the same service?": {
            "ui:widget": "radio"
        },
        "Describe the product or products you are comparing to: ": {
            "ui:widget": "textarea"
        },
        "Are there any required certifications, RSLs, or other standards or tests that must be complied with to be considered an improvement?": {
            "ui:widget": "textarea"
        }
    },
    "Stakeholder Communication": {
        "What is your plan for transparent communication about your product and materials?": {
            "ui:widget": "textarea"
        },
        "Have you shared your design priorities with related stakeholders?": {
            "ui:widget": "textarea"
        }
    }
}
